Revit 2015 API
DimensionType.SetAlternateUnitsFormatOptions Method
 Sets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public void SetAlternateUnitsFormatOptions(
	FormatOptions formatOptions
)
Visual Basic
Public Sub SetAlternateUnitsFormatOptions ( _
	formatOptions As FormatOptions _
)
Visual C++
public:
void SetAlternateUnitsFormatOptions(
	FormatOptions^ formatOptions
)
Parameters
formatOptions
Type: Autodesk.Revit.DB.FormatOptions
 The FormatOptions.
Remarks
 See the UnitType property to determine the unit type of this dimension style.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The display unit in formatOptions is not a valid display unit for the unit type of this DimensionType. See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType) and UnitUtils.GetValidDisplayUnits(UnitType).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
DimensionType Class
Autodesk.Revit.DB Namespace